{
  "title": "Álan Crístoffer",
  "public": "Public",
  "gpg_public_key": "GPG Public Key",
  "pt": "Portuguese",
  "en": "English",
  "fr": "French",
  "de": "German",
  "native": "Native",
  "about_me": "I'm a just-graduated mechatronics engineer interested in computer programming, control theory and languages. I'm a team worker. I know that sounds cliché, but I prefer to work in a cooperative environment than on a competitive one. I enjoy helping people solve problems and I have done it almost daily in the last 7 years, working almost like a tech-support for problems ranging from printers not working to implementing efficient graphing of the intersection of ellipsoids. I also like learning languages, playing computer games and listening to German Hard Rock.",
  "languages": "Languages",
  "tests_database_desc": "Manage questions and print tests.",
  "tb_ss1_desc": "This application was developed for the firefighter corporation of the state of Minas Gerais, Brazil, to manage the tests applied to the newcomers, as well as anual tests.",
  "tb_ss2_desc": "It lets them generate the tests using a simple interface, generating tests by question level or manual selection, objective or discursive, and can generate tests with question and answers in a random order, while keeping it easy to grade.",
  "tb_ss3_desc": "Questions can be added with a WYSIWYG text field, which allows the creation of tests with rich styling.",
  "and": "and",
  "cefss_desc": "Source code for bare-minimum applications to get started with Chromium Embedded Framework versions 1 and 3. Sets up a window, loads a HTML file and creates bidirectional binding between Javascript and C++ to show the very basic of a C++ application with HTML UI.",
  "ahio_desc": "ahio is a communication library whose goal is to abstract the interfacing with various I/O hardwares, so that changing hardware becomes possible with minimum code modification.",
  "moirai_desc": "Moirai is the backend of the control platform. It is developed as part of my scientific initiation project, named Plataformas de baixo custo para controle de processos (low-cost platform for process control), developed at CEFET-MG (Brazil) under the supervision of Prof. Dr. Valter Leite. The project was developed through a FAPEMIG scholarship. Controllers for this platform are written in Python 3 and can use any librarie available in the computer where moirai is running. It already depends on NumPy and SciPy, as they are commonly used. This platform manages the hardware interfacing through the ahio libray, so extending it's hardware capabilities is a question of extending AHIO, which should be simple. Execution time, sampling time, input querying and output updating is managed by the application and let's you focus on your controller/model.",
  "lachesis_desc": "Lachesis is the frontend of the control platform. This application allows you to configure the hardware, execute system response tests and run controllers with an easy to use interface. The used input and output signals, as well as variables, can be seen graphically, updating in real time. It works only as a frontend, meaning that all data is stored and managed in/by the moirai server. The server is also responsible for executing the controller. That means that you can install moirai in a dedicated computer, like a Raspberry Pi, and Lachesis in another one, using Lachesis like a remote control for your control system. This allows various user to share plant configuration.",
  "lachesis1_desc": "Setting up the hardware is as easy as filling a form.",
  "lachesis2_desc": "Visualize the control waveform before running open-loop tests.",
  "lachesis3_desc": "Simply choose the sampling time, execution duration and inputs. No need to worry about handling those. Now you can focus on your controller, which can be written in Python 3, a high-level and modern programming language.",
  "lachesis4_desc": "Visualize inputs, outputs and logged variables graphically in real-time. When the test is finished the data can be exported to JSON, CSV and MAT.",
  "tracker_desc": "Application to track packages using Correios site as backend. It doesn't work anymore as it makes no sense to update it now that Correios has its own application. However, the source code is kept on GitHub for reference.",
  "void_desc": "Void is an encrypted store. You can encrypt/decrypt files from/to the store. Encryption is carried out by NSS/NSPR using AES_GCM_256, SHA512, PKCS5_PBKDF2, HMAC_SHA512 with a cost of 250000. The store itself has a key derived from your password and each file has its own random key too. In disk all encrypted files get a salted-hash name, 128 digits long. Large files (50MB) are divided into smaller parts.",
  "void1_desc": "You can encrypt files and folders, and even set metadata like tags and comments.",
  "void2_desc": "Text files can be edited inside the application using the Ace editor, which supports theming and syntax highlight for 161 languages.",
  "void3_desc": "You can search files by matching their path, tags and comments.",
  "void4_desc": "Videos can be played from inside the application, without touching the disk. Images can also be displayed carousel-like.",
  "sigaa_desc": "WebScrapper that extracts grades from CEFET-MG's SIGAA portal, allowing students to see their grades, schedules and frequency in one interface, even when offline.",
  "sigaa_notas1_desc": "The student can select their immatriculation, when there is more than one.",
  "sigaa_notas2_desc": "Grades from all subjects are displayed in a single interface.",
  "sigaa_notas3_desc": "Schedules are shown by day, in order, making it easy to read them.",
  "sigaa_notas4_desc": "Frequency is also available on a single screen, but remember that it only shows what the professor inputs!",
  "%d years old, Brazilian": "%d years old, Brazilian",
  "contacts": "Contacts",
  "skills": "Skills",
  "site_languages": "Language of the page",
  "$skills": "System Analysis and Control, C/C++, Python, Kotlin, Assembly, MATLAB, Android Development, Frontend, Backend, Embedded, Automation, Robotics",
  "about": "About",
  "resume": "Curriculum Vitae",
  "projects": "Projects",
  "publications": "Publications",
  "experience": "Education/Experience",
  "experience_title": "Experience",
  "education": "Education",
  "intern": "Intern",
  "acal_desc": "During this internship, I developed a platform to measure the power loss inside the kernel of the inductor used in a PFC circuit.",
  "soldier": "Soldier",
  "cbmmg_desc": "As a firefighter I was entitled to work as a first-aider and diver, being the first response in all sorts of accidents, from fire in the wilds to car accidents and industrial and natural disasters.",
  "eng_meca": "Mecatronics Engineering Graduation",
  "mes_control": "Master in Electrical Engineering",
  "cefet_mes_desc": "A master student under the guidance of Prof. Dr. Valter Leite and Prof. Dr. Walter Lucia, researching fault-tolerant control in state-restricted switched systems.",
  "cefet_desc": "As a student, I started taking part in activities in my second year, as part of the team that won the 3rd place in the Latin American Robotic Competition. After that, I helped the student representatives in some activities without becoming a member, until accepting to become the student representative in the Graduation Council. Since my first semester, I helped other students from graduation and master with their projects, especially with programming.",
  "cefet_items": [
    "Robotics studying group (2014)",
    "Tutor of Computer Programming for Mechatronic and IT (Technical Course) students (2014)",
    "3rd place in the Latin America Robotic Competition (2014)",
    "Student exchange at Université Joseph Fourier (Grenoble, France) (2015)",
    "Student exchange at Frankfurt University of Applied Sciences (Frankfurt, Germany) (2015/16)",
    "Scientific Initiation: low-cost process control platform (2017)",
    "Scientific Initiation: process control platform: an MPC implementation (2018)",
    "Student member of the Graduation Council (2018/19)",
    "Advisor of a BIC-Jr entitled 'System modelling for process control' (2018)",
    "Advisor of a BIC-Jr entitled 'Modelling of a oven with space-distributed parameters' (2019)",
    "Advisor of a BIC-Jr entitled 'Control of a coupled tanks system' (2019)"
  ],
  "exchange_student": "Exchange Student",
  "fuas_desc": "I studied as an exchange student through the Brazilian government's program Ciências Sem Fronteiras (Science Without Borders).",
  "uga_desc": "I studied as an exchange student through the partnership between UGA and CEFET-MG. There I worked in the robotics laboratory helping the team who won the second place in the National Instruments MyRIO Paris competition."
}