{
  "title": "Álan Crístoffer",
  "public": "Public",
  "gpg_public_key": "Clè GPG publique",
  "pt": "Portugais",
  "en": "Anglais",
  "fr": "Français",
  "de": "Allemand",
  "native": "Maternelle",
  "about_me": "Je suis doctorant et travaille sur la détection et l'atténuation des attaques sur les systèmes cyber-physiques. Je suis une personne introvertie qui aime les environnements coopératifs. J'aime la programmation (pour que je puisse automatiser les tâches ennuyeuses) et d'apprendre les langues (pour que je puisse rester silencieux).",
  "languages": "Langues",
  "tests_database_desc": "Gérer les questions et imprimer les preuves.",
  "tb_ss1_desc": "Cette application a été développé pour la société de pompiers de l'état de Minas Gerais, au Brésil, pour gérer les preuves appliquées aux nouveaux arrivants, ainsi que les preuves annuelles.",
  "tb_ss2_desc": "Il leur permet de générer des preuves en utilisant une interface simple, en générant des preuves par niveau de question ou par selection manuelle, objectif ou discursive et aussi peut générer des preuves avec des questions et des réponses dans un ordre aléatoire, tout en gardant une simple correction.",
  "tb_ss3_desc": "Les questions peuvent être ajoutées avec un champ de texte WYSIWYG, qui permettent la création de preuves avec un format riche.",
  "and": "et",
  "cefss_desc": "Le code source des applications minimales pour commencer avec les versions de Chromium Embedded Framework versions 1 et 3. Mettre en place une fenêtre, charger un fichier HTML et créer une liaison entre Javascript et C++ bidirectionnel pour montrer une application très basique en C++ avec HTML UI.",
  "ahio_desc": "ahio est une bibliothèque de communication dont le but est de faire l’abstraction de l'interfaçage avec plusieurs matériaux d’entrées/sorties (I/O), pour reusir un changement de matériel  avec un minimum de modifications du code.",
  "moirai_desc": "Moirai est le backend de la plateforme de contrôle. Il est développé dans le cadre de mon projet d'initiation scientifique, intitulé Plataformas de baixo custo para controle de processos, développé au CEFET-MG (Brésil) sous la supervision du Prof. Dr. Valter Leite. Le projet a été développé grâce à une bourse FAPEMIG. Les contrôleurs de cette plate-forme sont écrits en Python 3 et peuvent utiliser n'importe quelle librairie disponible sur l'ordinateur où s'exécute moirai. Cela dépend déjà de NumPy et SciPy, car ils sont couramment utilisés. Cette plate-forme gère l'interface matérielle à travers la biblioteque ahio, donc étendre ses capacités matérielles est une question d'extension de AHIO, qui devrait être simple. Le temps d'exécution, le temps d'échantillonnage, l'interrogation d'entrée et la mise à jour de sortie sont gérés par l'application et concentrons-nous sur votre contrôleur/modèle.",
  "lachesis_desc": "Lachesis est l'interface de la plate-forme de contrôle. Cette application vous permet de configurer le matériel, d'exécuter des tests de réponse du système et d'exécuter des contrôleurs avec une interface facile à utiliser. Les signaux d'entrée et de sortie utilisés, ainsi que les variables, peuvent être visualisés graphiquement et mis à jour en temps réel. Il fonctionne uniquement en tant que frontend, ce qui signifie que toutes les données sont stockées et gérées dans/par le serveur moirai. Le serveur est également responsable de l'exécution du contrôleur. Cela signifie que vous pouvez installer moirai dans un ordinateur dédié, comme un Raspberry Pi, et Lachesis dans un autre, en utilisant Lachesis comme une télécommande pour votre système de contrôle. Cela permet à divers utilisateurs de partager la configuration de l'installation.",
  "lachesis1_desc": "La configuration du matériel est aussi simple que de remplir un formulaire.",
  "lachesis2_desc": "Visualisez la forme d'onde de contrôle avant d'exécuter des tests en boucle ouverte.",
  "lachesis3_desc": "Choisissez simplement le temps d'échantillonnage, la durée d'exécution et les entrées. Pas besoin de s'inquiéter de les manipuler. Maintenant, vous pouvez vous concentrer sur votre contrôleur, qui peut être écrit en Python 3, un langage de programmation de haut niveau et moderne.",
  "lachesis4_desc": "Visualisez les entrées, les sorties et les variables enregistrées graphiquement en temps réel. Lorsque le test est terminé, les données peuvent être exportées vers JSON, CSV et MAT.",
  "tracker_desc": "Application pour suivre les paquets en utilisant le site Correios comme backend. Il ne fonctionne plus car il n'a aucun sens de le mettre à jour maintenant que Correios a sa propre application. Cependant, le code source est conservé sur GitHub pour référence.",
  "void_desc": "Void est un stockage crypté. Vous pouvez crypter/décrypter des fichiers depuis/vers le stockage. Le chiffrement est effectué par NSS/NSPR à l'aide de AES_GCM_256, SHA512, PKCS5_PBKDF2, HMAC_SHA512 avec un coût de 250000. Le magasin lui-même a une clé dérivée de votre mot de passe et chaque fichier a sa propre clé aléatoire. Sur le disque, tous les fichiers chiffrés reçoivent un nom de hachage sale, long de 128 chiffres. Les gros fichiers (50 Mo) sont divisés en parties plus petites.",
  "void1_desc": "Vous pouvez chiffrer des fichiers et des dossiers et même définir des métadonnées telles que des balises et des commentaires.",
  "void2_desc": "Les fichiers texte peuvent être édités dans l'application à l'aide de l'éditeur Ace, qui prend en charge les thèmes et la coloration syntaxique pour 161 langues.",
  "void3_desc": "Vous pouvez rechercher des fichiers en faisant correspondre leur chemin, leurs balises et leurs commentaires.",
  "void4_desc": "Les vidéos peuvent être lues à l'intérieur de l'application, sans toucher le disque. Les images peuvent également être affichées comme un carrousel.",
  "sigaa_desc": "Web Scraper qui extrait les notes du portail CEFET-MG SIGAA, permettant aux étudiants de voir leurs notes, leurs horaires et leur fréquence dans une seule interface, même hors ligne.",
  "sigaa_notas1_desc": "L'étudiant peut sélectionner son immatriculation, lorsqu'il y en a plusieurs.",
  "sigaa_notas2_desc": "Les notes de tous les sujets sont affichées dans une seule interface.",
  "sigaa_notas3_desc": "Les horaires sont affichés par jour, dans l'ordre, ce qui facilite leur lecture.",
  "sigaa_notas4_desc": "La fréquence est également disponible sur un seul écran, mais n'oubliez pas qu'elle ne montre que ce que le professeur saisit!",
  "%d years old, Brazilian": "%d ans, Brésilien",
  "contacts": "Contacts",
  "skills": "Compétences",
  "site_languages": "Langue de la page",
  "$skills": "Analyse et contrôle du système, C/C++, Python, Kotlin, Assemblage, MATLAB, Développement Android, Frontend, Backend, Embarqué, Automatisation, Robotique",
  "about": "À propos",
  "resume": "Résumé",
  "projects": "Projets",
  "publications": "Publications",
  "experience": "Éducation/Expérience",
  "experience_title": "Expérience",
  "education": "Éducation",
  "intern": "Stagiaire",
  "acal_desc": "Au cours de ce stage, j'ai développé une plate-forme pour mesurer la perte de puissance à l'intérieur du noyau de l'inducteur utilisé dans un circuit PFC.",
  "soldier": "Soldat",
  "cbmmg_desc": "En tant que pompier, j’avais le droit de travailler comme secouriste et plongeur. C’était la première intervention dans toutes sortes d’accidents, des incendies dans la nature aux accidents de voiture, en passant par les catastrophes naturelles et naturelles.",
  "eng_meca": "Génie Mécatronique",
  "mes_control": "Master en Génie Électrique",
  "cefet_mes_desc": "Étudiant à la maîtrise sous la supervision du Prof. Dr. Valter Leite et Prof. Dr. Walter Lucia, recherchant le contrôle tolérant aux pannes dans les systèmes commutés à état restreint.",
  "cefet_desc": "En tant qu'étudiante, j'ai commencé à participer à des activités dès ma deuxième année au sein de l'équipe qui a remporté la 3ème place du concours robotique latino-américain. Après cela, j'ai aidé les représentants des étudiants dans certaines activités sans devenir membre, avant d'accepter de devenir le représentant des étudiants au sein du Conseil de remise des diplômes. Depuis le premier semestre, j’ai aidé d’autres finissants et des étudiants à la maîtrise à réaliser leurs projets, notamment en matière de programmation.",
  "cefet_items": [
    "Groupe d'étude en robotique (2014)",
    "Tuteur en programmation informatique pour étudiants en mécatronique et informatique (techniques) (2014)",
    "3ème place du concours robotique d'Amérique latine (2014)",
    "Échange universitaire à l'Université Joseph Fourier (Grenoble, France) (2015)",
    "Échange universitaire à l'Université des sciences appliquées de Francfort (Francfort, Allemagne) (2015/16)",
    "Initiation scientifique: plate-forme de contrôle des processus à faible coût (2017)",
    "Initiation scientifique: plate-forme de contrôle de processus: une implémentation de MPC (2018)",
    "Membre étudiant du conseil de graduation (2018/19)",
    "Co-superviseur d'un BIC-Jr intitulé 'Modélisation du système pour le contrôle des processus' (2018)",
    "Co-superviseur d'un BIC-Jr intitulé 'Modélisation d'un four à paramètres spatiaux' (2019)",
    "Co-superviseur d'un BIC-Jr intitulé 'Contrôle d'un système de réservoirs couplés' (2019)"
  ],
  "exchange_student": "Étudiant d'échange",
  "fuas_desc": "J'ai étudié en tant qu'étudiant d'échange dans le cadre du programme du gouvernement brésilien Ciências Sem Fronteiras (Science sans frontières).",
  "uga_desc": "J'ai étudié en tant qu'étudiant d'échange grâce au partenariat entre UGA et CEFET-MG. Là, j'ai travaillé dans le laboratoire de robotique en aidant l'équipe qui a remporté la deuxième place au concours National Instruments MyRIO Paris.",
  "phd_control": "Doctorat en Génie Électrique",
  "phd_desc": "Doctorant sous la direction du Prof. Dr. Nadhir Messai et du Prof. Dr. Nouredinne Manamanni, recherche sur la détection et l'atténuation des attaques sur les systèmes cyber-physiques."
}
