{
  "title": "Álan Crístoffer",
  "public": "Público",
  "gpg_public_key": "Chave GPG pública",
  "pt": "Português",
  "en": "Inglês",
  "fr": "Francês",
  "de": "Alemão",
  "native": "Nativo",
  "about_me": "Sou um engenheiro mecatrônico recém-formado interessado em programação de computadores, teoria de controle e línguas. Gosto de trabalhar em equipe. Eu sei que isso soa clichê, mas eu realmente prefiro trabalhar em um ambiente cooperativo do que em um competitivo. Gosto de ajudar as pessoas a resolver problemas e tenho feito isso quase diariamente nos últimos 7 anos, trabalhando quase como um suporte técnico para problemas que vão desde impressoras que não funcionam até implementar gráficos eficientes de interseção de elipsóides. Eu também gosto de aprender idiomas, jogar jogos de computador e ouvir Hard Rock Alemão.",
  "languages": "Idiomas",
  "tests_database_desc": "Gerencia um banco de questões e facilita a geração e correção de provas.",
  "tb_ss1_desc": "Este aplicativo foi desenvolvido para o estado de Minas Gerais, para gerenciar as provas aplicadas aos recrutas bem como provas anuais.",
  "tb_ss2_desc": "Ele permite que eles gerem as provas fácilmente, usando uma interface simples, que permite gerar testes personalizados, escolhendo o número e níveis de dificuldade das questões, se serão objetivas ou discursivas e pode embaralhar as questões e respostas, enquanto mantém o gabarito fácil de conferir.",
  "tb_ss3_desc": "As questões podem ser adicionas em um editor de texto rico, que permite a criação de questões estilizadas.",
  "and": "e",
  "cefss_desc": "Código fonte do mínimo necessário para usar o Chromium Embedded Framework versões 1 e 3. Cria uma janela, carrega um arquivo HTML e cria ligações bidirecionais entre Javascript e C++ para mostrar o básico de um aplicativo C++ com interface HTML.",
  "ahio_desc": "ahio é uma biblioteca de comunicação cujo objetivo é facilitar a conexão com vários hardwares de I/O de forma a possibilitar a mudança de hardware com mudanças mínimas de código.",
  "moirai_desc": "Moirai é o backend da plataforma de controle. Ela é desenvolvida como parte do meu projeto de iniciação científica, entitulado Plataformas de baixo custo para controle de processos, desenvolvido no CEFET-MG sob a supervisão do Prof. Dr. Valter Leite. O projeto é desenvolvido através do apoio da FAPEMIG. Controladores para esse projeto são escritos em Python 3 e podem usar qualquer biblioteca disponível no sistema. Ele já depende da NumPy e SciPy, que são comumente utilizadas. A plataforma gerencia a interface com o hardware através da biblioteca ahio. Desta forma, adicionar novos hardwares é tão simples quanto criar um novo driver pra ahio. Tempo de execução, amostragem, leitura de entradas e atualização das saídas são gerenciadas pela aplicação e permitem que você foque no seu controlador/modelo.",
  "lachesis_desc": "Lachesis é o frontend da plataforma de controle. Esta aplicação permite configurar o hardware, executar testes de resposta do sistema e executar controladores com uma interface fácil de usar. Os sinais de entrada e saída utilizados, assim como as variáveis, podem ser vistos graficamente, atualizando em tempo real. Ele funciona apenas como frontend, o que significa que todos os dados são armazenados e gerenciados no/pelo servidor moirai. O servidor também é responsável pela execução do controlador. Isso significa que você pode instalar o moirai em um computador dedicado, como um Raspberry Pi e o Lachesis em outro, usando o Lachesis como um controle remoto para o seu sistema de controle. Isso permite que vários usuários compartilhem a configuração da planta.",
  "lachesis1_desc": "Configurar o hardware é tão fácil quanto preencher um formulário.",
  "lachesis2_desc": "Visualize a forma de onda de controle antes de executar testes de loop aberto.",
  "lachesis3_desc": "Basta escolher o tempo de amostragem, a duração da execução e as entradas. Não precisa se preocupar em lidar com isso. Agora você pode se concentrar no seu controlador, que pode ser escrito em Python 3, uma linguagem de programação moderna e de alto nível.",
  "lachesis4_desc": "Visualize entradas, saídas e variáveis registradas graficamente em tempo real. Quando o teste terminar, os dados podem ser exportados para JSON, CSV e MAT.",
  "tracker_desc": "Aplicativo para rastrear pacotes usando o site dos Correios como backend. Não funciona mais, já que não faz sentido atualizá-lo agora que os Correios têm seu próprio aplicativo. No entanto, o código-fonte é mantido no GitHub para referência.",
  "void_desc": "Void é um armazenamento criptografado. Você pode criptografar/descriptografar arquivos de/para o armazenamento. A criptografia é realizada pelo NSS/NSPR usando AES_GCM_256, SHA512, PKCS5_PBKDF2, HMAC_SHA512 com um custo de 250000. A própria loja tem uma chave derivada de sua senha e cada arquivo tem sua própria chave aleatória também. No disco, todos os arquivos criptografados recebem um nome de hash salgado, com 128 dígitos. Arquivos grandes (50MB) são divididos em partes menores.",
  "void1_desc": "Você pode criptografar arquivos e pastas e até mesmo definir metadados como tags e comentários.",
  "void2_desc": "Arquivos de texto podem ser editados dentro do aplicativo usando o editor Ace, que suporta temas e realce de sintaxe para 161 idiomas.",
  "void3_desc": "Você pode pesquisar arquivos comparando seu caminho, tags e comentários.",
  "void4_desc": "Vídeos podem ser reproduzidos de dentro do aplicativo, sem tocar no disco. As imagens também podem ser exibidas em forma de carrossel.",
  "sigaa_desc": "WebScrapper que extrai as notas no site do SIGAA do CEFET-MG, permitindo que os alunos tenham suas notas, frequências e horários em um único lugar, e disponíveis offline.",
  "sigaa_notas1_desc": "O aluno pode selecionar seu vínculo, caso haja mais de um.",
  "sigaa_notas2_desc": "As notas de todas as disciplinas são exibidas em uma única interface.",
  "sigaa_notas3_desc": "Os horários são exibidos por dia, em ordem, facilitando a leitura.",
  "sigaa_notas4_desc": "A frequência também é exibida em uma única tela, mas lembre-se que só é exibido o que o professor lança!",
  "%d years old, Brazilian": "%d anos, Brasileiro",
  "contacts": "Contatos",
  "skills": "Competências",
  "site_languages": "Idioma da página",
  "$skills": "Análise e Controle de Sistemas, C/C++, Python, Kotlin, Montagem, MATLAB, Desenvolvimento Android, Frontend, Backend, Embarcado, Automação, Robótica",
  "about": "Sobre",
  "resume": "Currículo",
  "projects": "Projetos",
  "publications": "Publicações",
  "experience": "Formação/Experiência",
  "experience_title": "Experiência",
  "education": "Formação",
  "intern": "Estagiário",
  "acal_desc": "Durante este estágio desenvolvi uma plataforma para medir a perda interna de energia de um núcleo de um circuito de correção de fator de potência.",
  "soldier": "Soldado",
  "cbmmg_desc": "Como soldado minhas atribuições eram, principalmente, de primeiros socorros e mergulhador, sendo a primeira resposta em todo tipo de ocorrências, desde incêndios florestais até acidentes automotivos e desastres industriais ou naturais.",
  "eng_meca": "Graduação em Engenharia Mecatrônica",
  "mes_control": "Mestrado em Engenharia Elétrica",
  "cefet_mes_desc": "Mestrando sob orientação do Prof. Dr. Valter Leite e coorientação do Prof. Dr. Walter Lucia, pesquisando controle tolerante a falhas em sistemas chaveados com restrições nos estados.",
  "cefet_desc": "Como estudante, comecei a participar de atividades no meu segundo ano, como parte do grupo de estudo de robótica, ocupando o terceiro lugar na Competição Latino-America de Robótica de 2014. Em seguida ajudei o DA sem me associar, até aceitar me tornar o representante discente no Conselho de Graduação. Desde o primeiro semestre ajudei estudantes de graduação e mestrado com seus projetos, especialmente com programação.",
  "cefet_items": [
    "GER - Grupo de Estudos em Robótica (2014)",
    "Monitor de programação I e II para alunos da graduação e do curso técnico de informática (2014)",
    "3º lugar na Competição Latino-Americana de Robótica (LARC/2014)",
    "Intercambista na Université Joseph Fourier (Grenoble, França) (2015)",
    "Intercambista na Frankfurt University of Applied Sciences (Frankfurt, Alemanha) (2015/16)",
    "Iniciação Científica: Plataforma de baixo custo para controle de processos (2017)",
    "Iniciação Científica: Plataforma para controle de processos: implementação de um controlador MPC (2018)",
    "Representante discente no Conselho de Graduação (2018/19)",
    "Coorientador do BIC-Júnior 'Modelagem de planta pra controle de processos' (2018)",
    "Coorientador do BIC-Júnior 'Modelagem de um forno com sensores distribuídos no espaço' (2019)",
    "Coorientador do BIC-Júnior 'Controle de um sistema de tanques interconectados' (2019)"
  ],
  "exchange_student": "Intercambista",
  "fuas_desc": "Estudei como intercambista pelo programa Ciências Sem Fronteiras fomentado pela CAPES.",
  "uga_desc": "Intercambista pela parceria entre UGA e CEFET/MG. Trabalhei no laboratório de robótica ajudando o time que ficou em segundo lugar na competição da National Instruments, em Paris."
}